In [35]:
import sqlite3
import pandas as pd

In [36]:
Cinema = "im.db.3"
Budget = "tn.movie_budgets.csv"

In [37]:
conn = sqlite3.connect(Cinema)
cursor = conn.cursor()

In [ ]:
pd.read_sql("""
CREATE TABLE Movie_info AS
SELECT mb.movie_id, mb.primary_title, mb.start_year, mb.genres, d.person_id, p.primary_name
FROM movie_basics mb
JOIN directors d ON mb.movie_id = d.movie_id
JOIN persons p ON d.person_id = p.person_id;
ORDER BY start_year DESC
;
"""

, conn)

In [38]:
pd.read_sql("""
SELECT *
FROM Movie_info
;
"""
,conn)

,movie_id,primary_title,start_year,genres,person_id,primary_name
0,tt5174640,100 Years,2115,Drama,nm0001675,Robert Rodriguez
1,tt5637536,Avatar 5,2027,"Action,Adventure,Fantasy",nm0000116,James Cameron
2,tt5637536,Avatar 5,2027,"Action,Adventure,Fantasy",nm0000116,James Cameron
3,tt3095356,Avatar 4,2025,"Action,Adventure,Fantasy",nm0000116,James Cameron
4,tt3095356,Avatar 4,2025,"Action,Adventure,Fantasy",nm0000116,James Cameron
...,...,...,...,...,...,...
291166,tt9852508,Viyapath Bambara,2010,Drama,nm10510269,Prasad De Silva
291167,tt9875120,Frostbite,2010,Documentary,nm2901551,Jorge Requena Ramos
291168,tt9875242,15 Fotografii,2010,Drama,nm2437971,Franciszek Dzida
291169,tt9878374,Regi lagni comprensorio di stato,2010,Documentary,nm3462989,Loris Arduino
291170,tt9905932,Footloose in London: All the Best Sights of ou...,2010,None,nm1645815,David Rixon

In [39]:
Movie_Info = pd.read_sql_query("SELECT * FROM Movie_info", conn)

In [ ]:
Movie_Budget = pd.read_csv(Budget)

In [47]:
Movie_Info.rename(columns={"primary_title": "Title", "start_year": "Year", "primary_name": "Director", "genres": "Genre"}, inplace = True)

In [45]:
Movie_Info.drop(columns = ["movie_id", "person_id"], inplace = True)

In [49]:
Movie_Info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 291171 entries, 0 to 291170
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Title     291171 non-null  object
 1   Year      291171 non-null  int64
 2   Genre     284612 non-null  object
 3   Director  291171 non-null  object
dtypes: int64(1), object(3)
memory usage: 8.9+ MB

In [60]:
Movie_Info = Movie_Info[Movie_Info["Year"] < 2023]

In [61]:
Movie_Info.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 291159 entries, 12 to 291170
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Title     291159 non-null  object
 1   Year      291159 non-null  int64
 2   Genre     284600 non-null  object
 3   Director  291159 non-null  object
dtypes: int64(1), object(3)
memory usage: 11.1+ MB

In [32]:
Movie_Budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"